# 字段映射 & 参数配置

# =========================
# 文件路径
# =========================
DATA_PATH = "data/价格预测数据集.csv"

# =========================
# 时间字段
# =========================
COL_DATE = "日期"
COL_TIME = "时刻"

# =========================
# 价格字段
# =========================
COL_DA_PRICE = "日前价格"
COL_RT_PRICE = "实时价格"

# =========================
# 预测字段（D-1 可得）
# =========================
COL_LOAD_FC = "直调负荷(预测)"
COL_WIND_FC = "风电总加(预测)"
COL_PV_FC   = "光伏总加(预测)"
COL_TIE_FC  = "联络线受电负荷(预测)"   # 目前未用，但保留

# =========================
# 节假日字段（真实存在）
# =========================
COL_IS_HOLIDAY = "是否节假日"
COL_IS_WEEKEND = "是否周末休息日"

# =========================
# 参数
# =========================
PV_RATIO_Q = 0.75
WIND_RATIO_Q = 0.75
LOAD_Q = 0.75

